# config.py
# ===== НАСТРОЙКИ =====

# Чат для управления
ADMIN_CHAT = -1004324045828

# Файлы
SETTINGS_FILE = "search_settings.json"
SESSION_FILE = "search_bot"
BLACKLIST_FILE = "blacklist.json"

# API ключи
API_ID = 2040
API_HASH = "b18441a1ff607e10a989891a5462e627"

# Настройки форматирования
MAX_MESSAGE_LENGTH = 1500
TIME_FORMAT = "%H:%M:%S"

# ===== ПЕРВЫЙ СТОЛБЕЦ - действия/глаголы =====
COLUMN_1 = [
  "куплю", "дайте", "роспишите", "роспись", "автограф", 
    "подпись", "активируйте", "активация", "активацию", 
    "косключ", "gk", "заберу", "приму", "принимаю",
    "подписать", "скупаю",
    # НОВЫЕ СЛОВА:
    "приобрету",
    "скуплю",
    "выкуплю",
    "забираю",
    "выкупаю",
    "приобритаю"
]

# ===== ВТОРОЙ СТОЛБЕЦ - операторы/цвета/названия =====
COLUMN_2 = [
    # МТС (красный)
    "мтс", "mts", "красного", "красный", "мтса", "красных",
    "mt$",            # <--- ДОБАВЛЕНО (замена буквы s на $)
    
    # Мегафон (зеленый)
    "мегафон", "мегу", "мега", "meg", "зеленого", "мегафона", 
    "зелень", "мегафонов",
    
    # Tele2 (черный)
    "t2", "т2", "теле2", "tele2", "черного", "черный", "черных",
    
    # Билайн (желтый)
    "билайн", "пчелу", "пчела", "желтого", "желтый", "бил", 
    "билку", "билайна", "билки", "билайнов",
    
    # Йота (синий/голубой)
    "йоты", "йота", "йоту", "yota", "синего", "синий", 
    "голубой", "голубова", "йот", "голубых", "синих",
    
    # Миранда
    "миранда", "миранды", "миранду", "миранд", "miranda",
    
    # Волна
    "волна", "волну", "волны", "волн",
    
    # Сбер
    "сбер", "сбермобаил", "сбера", "сберов", "сбермобайлов",
    
    # Добро
    "добро", "добросвязь",
    
    # НН оператор
    "нн", "оператор",
    
    # Озон
    "озон", "озоны", "ozon", "расширенный", "озонов"
]

